{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "same", "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 15, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_2"}}], "name": "sequential_1"}}, "training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-07, "decay": 0.0, "lr": 1.0, "rho": 0.95}}, "loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"]}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [65536, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [128, 15], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [15], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}